//由验证得知，在c语言中，只会从main()开始执行，只能有一个main()。否则会报错，这一点不向python
//！！！注意：浮点数分E不全为0或1，E全为0，E全为1 这里的E是指实际值加127 因为规定存的时候要真实值加127
//1.E不全为0或1 取得时候-127
//2.E全为0,说明真实值是127，规定取出的是1-127=-126，另外有效数前面补0。此时这个浮点数小的离谱，几乎可认为是0
//3.E全为1，说明真实值是128。此时这个浮点数大得离谱，认为是无穷大
#define _CRT_SECURE_NO_WARNINGS

//浮点数家族包括：float,double,long double
#include <stdio.h>
#include <string.h>


/*浮点型存储方式
//###错的：符号位S(1-负数，0-正数)，有效位（1-2，占8位），指数位-23位
//符号位S(1-正数，0-负数)，有效数字M（1-2，占23位），指数位E(占8位)
//###错的：S+M+2^E
//(-1)^S+M+2^E
*/
int main()
{
	int n = 9;
	//9在整型中的存储 00000000 00000000 00000000 00001001
	float* pFloat = (float*)&n;
	//此时认为00000000 00000000 00000000 00001001是浮点型
	//S=0-正数 E全0（原数1-127=-126） 前面补0 0.0000000 00000000 00001001*2^-126即0
	printf("n=%d\n", n);	//9
	printf("*pFloat=%f\n", *pFloat);	//0.000000
	*pFloat = 9.0;
	//1001.0即1.001 * 2 ^ 3即S = 0, M = 001, E = 3(真实值)
	//	3 + 127 = 130 = 01000011
	//	0  10000010 00100000000000000000000即1091567616
	printf("n=%d\n", n);	//1091567616
	//int n认为0 10000010 00100000000000000000000是整型，则十进制
	printf("* pFloat % f", *pFloat);	//9.000000
	return 0;	
}



